app/controllers/api/v2/months_controller.rb

SELECT "products".* FROM "products" WHERE "products"."months_available" = $1  [["months_available", "April"]]
---
  def set_month
    @month = Product.where(months_available: params[:id])