app/controllers/api/v2/products_controller.rb

UPDATE "products" SET "kind" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["kind", "New"], ["updated_at", "2020-12-27 16:37:58.564478"], ["id", 1]]
---
  def update
    if @product.update(product_params)

INSERT INTO "products" ("name", "kind", "months_available", "seasons_available", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user
    authorize @product
    if @product.save