app/controllers/api/v2/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."name" = $1  [["name", "Apple"]]
---
  def set_product
    @product = Product.where(name: params[:id])