app/controllers/api/v2/selkinds_controller.rb

SELECT "products".* FROM "products" WHERE "products"."kind" = $1  [["kind", "fruit"]]
---
  def set_selkinds
    @selkind = Product.where(kind: params[:id])