app/controllers/api/v2/selnames_controller.rb

SELECT "products".* FROM "products" WHERE "products"."name" = $1  [["name", "Lemon"]]
---
  def set_selnames
    @selname = Product.where(name: params[:id])