app/controllers/api/v1/products_controller.rb

UPDATE "products" SET "name" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["name", "New name"], ["updated_at", "2020-12-19 18:43:46.209604"], ["id", 1]]
---
  def update
    if @product.update(product_params)

INSERT INTO "products" ("name", "kind", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Pine Apple"], ["kind", "fruits"], ["user_id", 1], ["created_at", "2020-12-19 19:02:39.107057"], ["updated_at", "2020-12-19 19:02:39.107057"]]
---
  def create
    @product = Product.new(product_params)
    @product.user = current_user
    authorize @product
    if @product.save